FOAMySees-main/FOAMySeesExampleCases/CantileverBeam/noGroundMotion/Fluid/0.org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    interface
    {
        type     fixedFluxPressure; 
		value $internalField;
    }
    leftWall
    {
        type     fixedFluxPressure; 
		value $internalField;
    }

    rightWall
    {
        type     fixedFluxPressure; 
		value $internalField;
    }

    lowerWall
    {
        type     fixedFluxPressure; 
		value $internalField;
    }

    atmosphere
    {
        type            totalPressure;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1;
        p0              $internalField;
        value           $internalField;
    }


    defaultFaces
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
